{
    "format": "layers-model",
    "generatedBy": "keras v2.8.0",
    "convertedBy": "TensorFlow.js Converter v3.18.0",
    "modelTopology": {
        "keras_version": "2.8.0",
        "backend": "tensorflow",
        "model_config": {
            "class_name": "Sequential",
            "config": {
                "name": "sequential",
                "layers": [
                    {
                        "class_name": "InputLayer",
                        "config": {
                            "batch_input_shape": [
                                null,
                                75
                            ],
                            "dtype": "float32",
                            "sparse": false,
                            "ragged": false,
                            "name": "embedding_input"
                        }
                    },
                    {
                        "class_name": "Embedding",
                        "config": {
                            "name": "embedding",
                            "trainable": true,
                            "batch_input_shape": [
                                null,
                                75
                            ],
                            "dtype": "float32",
                            "input_dim": 10000,
                            "output_dim": 128,
                            "embeddings_initializer": {
                                "class_name": "RandomUniform",
                                "config": {
                                    "minval": -0.05,
                                    "maxval": 0.05,
                                    "seed": null
                                }
                            },
                            "embeddings_regularizer": null,
                            "activity_regularizer": null,
                            "embeddings_constraint": null,
                            "mask_zero": false,
                            "input_length": 75
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": true,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 64,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 2
                        }
                    },
                    {
                        "class_name": "LSTM",
                        "config": {
                            "name": "lstm_1",
                            "trainable": true,
                            "dtype": "float32",
                            "return_sequences": false,
                            "return_state": false,
                            "go_backwards": false,
                            "stateful": false,
                            "unroll": false,
                            "time_major": false,
                            "units": 64,
                            "activation": "tanh",
                            "recurrent_activation": "sigmoid",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "recurrent_initializer": {
                                "class_name": "Orthogonal",
                                "config": {
                                    "gain": 1.0,
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "unit_forget_bias": true,
                            "kernel_regularizer": null,
                            "recurrent_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "recurrent_constraint": null,
                            "bias_constraint": null,
                            "dropout": 0.0,
                            "recurrent_dropout": 0.0,
                            "implementation": 2
                        }
                    },
                    {
                        "class_name": "Dense",
                        "config": {
                            "name": "dense",
                            "trainable": true,
                            "dtype": "float32",
                            "units": 3,
                            "activation": "softmax",
                            "use_bias": true,
                            "kernel_initializer": {
                                "class_name": "GlorotUniform",
                                "config": {
                                    "seed": null
                                }
                            },
                            "bias_initializer": {
                                "class_name": "Zeros",
                                "config": {}
                            },
                            "kernel_regularizer": null,
                            "bias_regularizer": null,
                            "activity_regularizer": null,
                            "kernel_constraint": null,
                            "bias_constraint": null
                        }
                    }
                ]
            }
        },
        "training_config": {
            "loss": {
                "class_name": "CategoricalCrossentropy",
                "config": {
                    "reduction": "auto",
                    "name": "categorical_crossentropy",
                    "from_logits": false,
                    "label_smoothing": 0.0,
                    "axis": -1
                }
            },
            "metrics": [
                [
                    {
                        "class_name": "MeanMetricWrapper",
                        "config": {
                            "name": "accuracy",
                            "dtype": "float32",
                            "fn": "categorical_accuracy"
                        }
                    }
                ]
            ],
            "weighted_metrics": null,
            "loss_weights": null,
            "optimizer_config": {
                "class_name": "SGD",
                "config": {
                    "name": "SGD",
                    "learning_rate": 0.550000011920929,
                    "decay": 0.0,
                    "momentum": 0.0,
                    "nesterov": false
                }
            }
        }
    },
    "weightsManifest": [
        {
            "paths": [
                "group1-shard1of2.bin",
                "group1-shard2of2.bin"
            ],
            "weights": [
                {
                    "name": "dense/kernel",
                    "shape": [
                        64,
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "dense/bias",
                    "shape": [
                        3
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "embedding/embeddings",
                    "shape": [
                        10000,
                        128
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/kernel",
                    "shape": [
                        128,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm/lstm_cell/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell_1/kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell_1/recurrent_kernel",
                    "shape": [
                        64,
                        256
                    ],
                    "dtype": "float32"
                },
                {
                    "name": "lstm_1/lstm_cell_1/bias",
                    "shape": [
                        256
                    ],
                    "dtype": "float32"
                }
            ]
        }
    ]
}